import { PHOTO_SIDE_SIZE_LOW_QUALITY } from '../config';
import type { I18nKey } from './I18nKey';

export const uk: Record<I18nKey, string> = {
    start: `Здоровенькі були! Я - бот з мемами. Почни мене згадувати в будь-якому чаті (@picmemebot), а потім набери ключові слова мему, а я видам тобі відповідні зображення. Якщо чогось немає - скидай мені сюди зображення розміром більше за ${PHOTO_SIDE_SIZE_LOW_QUALITY}px по найменшій стороні і напиши ключові слова (одне ключове слово - один рядок)`,
    error_no_photo_specified: 'Не передано фото',
    error_photo_low_quality: `Фотографія в низькій роздільній здатності. Мінімально допустимий розмір по найменшій стороні фотографії - ${PHOTO_SIDE_SIZE_LOW_QUALITY}px`,
    error_no_specified_tags: 'Не вказано тегів. У повідомленні з фотографією в тексті вкажіть ключові слова (теги), за якими можна знайти це мем. Кожен тег на новому рядку.',
    successfully_added: 'Мем додано. Спочатку він доступний лише тобі, але після перевірки буде доступний усім.',
};
